/*
window.newspaperdata = [newspapers];
newspapers = newspapers, newspaper || newspaper
newspaper = {'name':NAME,'date':DATE_STRING,'articles':[articles]}
articles = articles, article || article
article = {'title':TITLE,'author':AUTHOR_NAME,'sample':DESCRIPTION,'content':HTML_COTENT,'color':[R_VALUE,G_VALUE,B_VALUE]}
*/
window.newspaperdata = [
  {
    'name':'שאלות על האתר וכאלה דברים'
    ,'date':'מתעדכן מדי פעם'
    ,'articles':[
      {
        'title':'מה האינטרס שלכם ליצור את האתר הזה?'
        ,'author':'ארד קרן'
        ,'sample':'זה הופך אותנו לאינטרסנטים?'
        ,'content':'<p>להשתלט על העולם, כמובן! (אפקט קול דרמטי כאן)</p><p>אולי כדאי לציין שאנחנו עושים את זה כחלק מהָמַאֲחָד. מה זה? תגלו בגליון הבא של... הטרפזי!</p>'
        ,'color':[168, 184, 159]
      }
      ,{
        'title':'להיות או לא להיות?'
        ,'author':'ארד קרן'
        ,'sample':'זו השאלה!'
        ,'content':'<p>אם אני אני כי אתה אתה ואתה אתה כי אני אני אז אני לא אני ואתה לא אתה, אבל, אם אני אני כי אני אני ואתה אתה כי אתה אתה אז אני אני ואתה אתה!</p>'
        ,'color':[188,204,180]
      }
      ,{
        'title':'למה זה השם? מה זה הטרפזי?'
        ,'author':'ארד קרן'
        ,'sample':'זו. זו לא אמורה. להיות שאלה בעייתית, נכון? נכון?'
        ,'content':'<p>קופסת פנדורה! חתכת אותה בחצי! אז ככה, היה וויכוח גדול על איזה שם יהיה. אף אחד לא הסכים. וככה הגענו למצב הנוכחי, הסוף! (תאמינו לי, זה הגיוני)</p>'
        ,'color':[97,148,58]
      }
      ,{
        'title':'איך אני יוצר איתכם קשר?'
        ,'author':'ארד קרן'
        ,'sample':'למה שתרצה לעשות דבר שכזה???'
        ,'content':'<p>אלה שמכירים אותנו יכולים לדבר איתנו, אבל לאלה שלא, אתם יכולים לדבר איתנו <a href="https://goo.gl/forms/PtQUUrODsNHA5fFk1">כאן</a>. אם אתם רוצים לקבל תקשורת חזרה אתם יכולים להעביר לנו ערוץ תקשורת אחר (מומלץ דואר אלקטרוני), נשתדל לענות אבל אנחנו לא יכולים להתחייב (אנחנו לא יכולים להתחייב לכלום, אף־פעם, אי־פעם, במיוחד לזה).</p>'
        ,'color':[175, 205, 154]
      }
      ,{
        'title':'למה אין מערכת תגובות נורמלית?'
        ,'author':'ארד קרן'
        ,'sample':'הצעירים האלה והתגובות שלהם!'
        ,'content':'<p>בטרפזי בחרנו לא להוסיף לאתרינו מערכת תגובות, במקומה שלה אנו מעודדים אתכם לשלוח לנו קטעים, קטעי תגובה או קטעים בתור עצמם, לפרסום. דרכים ליצור אתנו קשר תוכלו לראות <a href="#newspaper:0;article:3">כאן</a>. נסביר כעת מדוע בחרנו כפי שבחרנו.</p><ol><li>אנחנו רוצים לעודד דיון מעמיק \בנוגע לתכנים אשר מפורסמים דרכינו. מערכת תגובות, לעומת זאת,  מעודדת דיון רדוד, מהיר וחסר מחשבה, בגלל שהיא מועדדת תקשורת מהירה שגוררת פחות חשיבה ורפלקציה ועקב ההגבלה, אם רק פסיכולוגית או שאינה, על אורך התשובה שמגביל את יכולתה לכסות את המקור באופן מלא. אם ברצונכם לשלוח אלינו קטע תגובה, אנו נכבד זאת כל עוד הקטע הוא ברמה מספיקה.</li><li>אתר המארג (רשת) שלנו נועד להטען ולעבוד במהירות כדי לשפר את חווית הקריאה. הוספת מערכת תגובות תעט אותו משמעותית: מערכת תגובות כוללת בתוכה תוספת גדולה לכמות המשאבים שנדרשים עבור טעינתו.</li><li>בגלל שאין אנו פועלים עם צד־שרת כל־שהוא, אם נבחר לעשות שימוש במערכת תגובות, נאלץ לעשות זאת על ידי שירות צד שלישי. שירותים אילו דורשים מכותבי התגובות יצירת חשבון בשירות זה, דרישה זו תגרום לרבים שאינם רשומים לא לשקול את אפשרות התגובה ותיצור אייליאניזציה מסוימת. במערכת הנוכחית ישנה בעייה דומה שנשקול לה תיקון, אם זאת, יצירת מערכת תגובות תקבע אותה כשם שאין לנו דרך לשנות את דרך פעולתה.</li></ol><p>אנו מקווים שאתם מבינים את הבחירה שלנו. אם אתם לא מסכימים אתם יכולים לשלוח לנו קטע נגדי לפי ההוראות שנמצאות <a href="#newspaper:0;article:3">כאן</a>.</p>'
        ,'color':[155, 198, 197]
      }
      ,{
        'title':'מתי יעלה הגליון הראשון?'
        ,'author':'איתמר רוט וארד קרן'
        ,'sample':'אי־שם, מעבר לקשת...'
        ,'content':'<p>אנחנו מקווים שבקרוב מאוד. היכנסו לאתר מידי פעם כדי לראות.</p><p>האמת היא שאם אתם כאן כבר לפני שיצא הגליון הראשון, אנחנו כנראה מכירים אישית, ונאמר לכם בכל מקרה. אם לא, ואו, כל הכבוד!</p>'
        ,'color':[147, 230, 224]
      }
      ,{
        'title':'מה זה האתר הזה? מה אני יכול לעשות? איפה טעיתי בחיים שלי?'
        ,'author':'ארד קרן'
        ,'sample':'אתם יכולים לקרוא דברים. לחצו כדי לקרוא את אותו דבר אבל מחורטט.'
        ,'content':'<p>מטרת האתר הזה היא לאפשר העברת ידע מהירה ויעילה יותר בין ילדים אינטלקטואליים או משהו כזה, זהו עיתון מקוון הנועד לילדים מחוננים וחבריהם האינטלקטואליים ומכוון בעיקר כלפי הקהל מהרצליה, שהופך את כל השאר למיוחדים, אני מניח. אתם יכולים לקרוא את זה אם משעממם לכם וברצונכם ליקרוא תוכן איכותי וייחודי (כלומר, שאינו העתקה ברעיון של מאמר ממקור אחר שסביר יחסית שקראתם, או יכולתם אם זה היה מעניין אתכם),אתם יכולים לשלוח אלינו קטע, לפי ההנחיות <a href="#newspaper:0;article:3">כאן</a>.</p>'
        ,'color':[77, 101, 100]
      }
    ]
  }
  ,{
    'name':'תוכן יגיע בקרוב!'
    ,'date':'מתישהו'
    ,'articles':[
      {
        'title':'אמרנו „תוכן יגיע בקרוב”!'
        ,'author':'ארד קרן'
        ,'sample':'זה אומר שאין תוכן!'
        ,'content':'<img src="./article_resources/eastereggs/lick_my_arse.jpg" style="background-color:#161307;" /><p>קיימת תפיסה של וולפגנג אמדאוס מוצרט כאריסטוקרט חסר הומור, אבל הראיות אומרות אחרת. כשוולפגנג מוצג כאדם בעל חוש הומור ילדותי במדיה בדרך כלל מאשימים אותה ביצוג לא נכון, אבל זהו כנראה ייצוג נכון יותר משחשבתם.</p><p>בשנת 1782 מוצרט כתב כנון שנקרא „<span lang="de">Leck mich im Arsch</span>”, מילולית: „לקק אותי בתחת”. אחרי שמוצרט מת, נשלחו מספר  מיצירותיו לפירסום, כולל זו, שהותאמה ל־„<span lang="de">Laßt froh uns sein</span>”, מילולית: „תן לנו להיות שמחים”. הטקסט המקורי התגלה ב־1991 אחרי שספריית המוזיקה של הרווארד רכשה ספר שבו נוספו בכתב יד מספר יצירות נוספות, ובגלל שחלקן היו ידועות כבר כיצירות של מוצרט הונח שהשאר הם גם כן.</p><p>יצירה נוספת שהתגלתה מאותו ספר היא „<span lang="de">Leck mir den Arsch fein recht schön sauber</span>”, מילולית: לקק לי את התחת  טוב ונקי, שבמקור נחשבה להיות גם יצירה של מוצרט, אם כי מאוחר יותר נמצאו ראיות שונזל טרנקה הלחין אותה, אם כי המילים הן אכן של וולפגנג.</p><p>ישנן התיחסויות אחרות ביצירותיו לליקוק התחת, אם כי אלה הן הכי ברורות. נוסף על כך, הוא משתמש בביטוי וברמיזות לתחת במכתבים רבים. ואולי יש כאן מסקנה מוזרה על איך אנחנו יכולים להשתחרר, אבל זה איסטר אגג ארטיקל, אני לא צריך לעשות את כל החרא הזה!</p><p>דרך אגב, אנחנו מעדיפים כתבות דעה על פני כתבות טריוויה, אבל לא נורא.</p>'
        ,'color':[200,200,70]
      }
    ]
  }
];